Phase 1:

Business Identification:

a. Dataset Analysis

b. made good recommendations for DQLab

Helpful question
1. How much is the sales revenue from the sale of DQlab?
2. How much is the net profit margin from the DQlab sale?
3. How much is the cost of customer acquisition (CAC) from DQlab sales?


Stakeholders
Main
DQLab Owner: One of the founders of DQLab

Secondary
DQlab marketing analytics team: A team of data analysts responsible for collecting, analyzing, and reporting data that can help build DQlab's marketing strategy

Phase 2 Prepare data:

A. Data identification

Dataset: DQLAB historical sales data This Kaggle dataset contains 3 product categories, namely office supplies, technology, and furniture. Each category has several subcategories. The company also runs promotions in the form of discounts.

B. Look at the credibility of the data.

I'd use the ROCCC method to see if the data is credible.

1. Reliability: the data is still not reliable because it does not display the amount of margin of error and a small sample size (30 participants) is not found; this is necessary in order to limit the number of analyses that can be performed.

2. Original: This data is original because it uses a data set from a direct company, namely DQLab, but was downloaded via a third party, namely Kagle.

3. Comprehensive: This dataset is not comprehensive because it does not provide information in the form of gender, age, purchase status, etc. which means the data is not random. If the data is biased, the information in the data will make the analysis unacceptable.

4. Current: This data was taken in 2009–2012, which is outdated. So it can be concluded that the data does not represent the original data.

5. Cited: In accordance with the previous discussion, this data was taken from the Keagel account named Dhany Farras Putra, but there is a link that leads directly to the DQLab website.

Data integrity and credibility are clearly not enough to provide DQlab with reliable and comprehensive insights. Therefore, the following analysis can only provide the first clues and directions that must be verified through the analysis of larger and much more reliable data sets.

Phase 3 Proseses
Pada proses ini akan menggunakan python

Cleaning Data Project

In [1]:
# Import Library
import pandas as pd
import numpy as np
import plotly.express as px
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Import Dataset
df_raw = pd.read_csv('raw_data.csv')

See the top 5 and bottom 5 data sets.

In [3]:
df_raw.head()

   order_id | order_status    | customer               | order_date | order_quantity | sales     | discount | discount_value | product_category | product_sub_category           |
0  +----------+-----------------+----------------...
1  |        3 | Order Finished  | Muhammed MacInt...
2  |      293 | Order Finished  | Barry French   ...
3  |      483 | Order Finished  | Clay Rozendal  ...
4  |      515 | Order Finished  | Carlos Soltero ...

In [4]:
df_raw.tail()

      order_id | order_status    | customer               | order_date | order_quantity | sales     | discount | discount_value | product_category | product_sub_category           |
5496  |    52706 | Order Finished  | Paul Prost     ...
5497  |    54279 | Order Finished  | Lisa DeCherney ...
5498  |    55558 | Order Finished  | Philip Brown   ...
5499  |    56581 | Order Finished  | Lisa DeCherney ...
5500  +----------+-----------------+----------------...

on the index dataset, starting from 0 and ending at 5500.

In [5]:
# Check the amount of data before cleaning.
print('The amount of data before cleaning %d row and %d kolom ' % df_raw.shape)

The amount of data before cleaning 5501 row and 1 kolom

I omitted rows 0 and 5500 because they had the wrong data values.

In [6]:
df_raw_drop = df_raw.drop(index=[0,5500])

View the top 5 data and the bottom 5 data after cleaning.

In [7]:
df_raw_drop.head()

   order_id | order_status    | customer               | order_date | order_quantity | sales     | discount | discount_value | product_category | product_sub_category           |
1  |        3 | Order Finished  | Muhammed MacInt...
2  |      293 | Order Finished  | Barry French   ...
3  |      483 | Order Finished  | Clay Rozendal  ...
4  |      515 | Order Finished  | Carlos Soltero ...
5  |      613 | Order Finished  | Carl Jackson   ...

In [8]:
df_raw_drop.tail()

      order_id | order_status    | customer               | order_date | order_quantity | sales     | discount | discount_value | product_category | product_sub_category           |
5495  |    47360 | Order Finished  | Philip Brown   ...
5496  |    52706 | Order Finished  | Paul Prost     ...
5497  |    54279 | Order Finished  | Lisa DeCherney ...
5498  |    55558 | Order Finished  | Philip Brown   ...
5499  |    56581 | Order Finished  | Lisa DeCherney ...

In [9]:
# Check the dataframe after removing the two rows.
df_raw_drop.shape

(5499, 1)

See column index ranged index for more information.

In [10]:
df_raw.columns

Index([' order_id | order_status    | customer               | order_date | order_quantity | sales     | discount | discount_value | product_category | product_sub_category           |'], dtype='object')

In [11]:
df_raw_drop.index

RangeIndex(start=1, stop=5500, step=1)

There is some data that should be stored in each column, but it is stored in only one column, namely the first column. It is necessary to reset the data.

Creat list for dataframe Column

In [12]:
# Creating string from list from series
coloumn_string = str(list(df_raw_drop.columns))

#Combining 2 list to become string data type
coloumn_string = ''.join(coloumn_string)

#Remove space between letters
coloumn_string = coloumn_string.replace(' ','')

#Slicing the string to remove square brackets from left and right
coloumn_string = coloumn_string[2:-3]

#Split string. From string data type to list data type
df_columns = coloumn_string.split('|')

print('Column dataFrame Length:', len(df_columns))
df_columns

Column dataFrame Length: 10

['order_id',
 'order_status',
 'customer',
 'order_date',
 'order_quantity',
 'sales',
 'discount',
 'discount_value',
 'product_category',
 'product_sub_category']

In [13]:
# Make a list for dataFrame Row
# Import Regexes for string manipulation
import re

In [14]:
i = 0
df_rows = []

while i <5499:
    #Creating string from list from series
    row_string = str(list(df_raw_drop.iloc[i]))
    
    #Combining 2 list to become string data type
    row_string = ''.join(row_string)
    
    #Remove space between letters
    row_string = row_string.replace(" ","")
    
    #Slicing the string to remove square brackets from left and right
    row_string = row_string[3:-3]
    
    #Separating word for everty uppercase letter using regex function
    row_string = re.sub(r"(\w)([A-Z])", r"\1 \2", row_string)
    
    #Split string. From string data type to list data type
    row_string = row_string.split('|')
    
    #Adding list to a list container
    df_rows.append(row_string)
    i+= 1

print('The length of dataframe rows:', len(df_rows))
print(df_rows[0:3])

The length of dataframe rows: 5499
[['3', 'Order Finished', 'Muhammed Mac Intyre', '2010-10-13', '6', '523080', '0.04', '20923', 'Office Supplies', 'Storage&Organization'], ['293', 'Order Finished', 'Barry French', '2012-10-01', '49', '20246040', '0.07', '1417223', 'Office Supplies', 'Appliances'], ['483', 'Order Finished', 'Clay Rozendal', '2011-07-10', '30', '9931519', '0.08', '794522', 'Technology', 'Telephonesand Communication']]

Creating DataFramme

In [15]:
df_clean = pd.DataFrame(df_rows, columns=df_columns)
df_clean.head()

,order_id,order_status,customer,order_date,order_quantity,sales,discount,discount_value,product_category,product_sub_category
0,3,Order Finished,Muhammed Mac Intyre,2010-10-13,6,523080,0.04,20923,Office Supplies,Storage&Organization
1,293,Order Finished,Barry French,2012-10-01,49,20246040,0.07,1417223,Office Supplies,Appliances
2,483,Order Finished,Clay Rozendal,2011-07-10,30,9931519,0.08,794522,Technology,Telephonesand Communication
3,515,Order Finished,Carlos Soltero,2010-08-28,19,788540,0.08,63083,Office Supplies,Appliances
4,613,Order Finished,Carl Jackson,2011-06-17,12,187080,0.03,5612,Office Supplies,Bindersand Binder Accessories

In [16]:
# Check Missing Value
df_clean.isnull().sum()

order_id                0
order_status            0
customer                0
order_date              0
order_quantity          0
sales                   0
discount                0
discount_value          0
product_category        0
product_sub_category    0
dtype: int64

Theres no Missing Value after Cleaning

In [17]:
# Chek Values each column
df_clean['order_id'].value_counts()

29795    2
31781    2
40519    2
3        1
32356    1
        ..
36737    1
36294    1
36230    1
36196    1
56581    1
Name: order_id, Length: 5496, dtype: int64

In [18]:
df_clean['order_status'].value_counts()

Order Finished     4924
Order Returned      572
Order Cancelled       3
Name: order_status, dtype: int64

In [19]:
df_clean['customer'].value_counts()

Bill Donatelli            39
Maria Bertelson           33
Darren Budd               26
Brad Thomas               24
Christina Vanderzanden    22
                          ..
Sample Company A           1
Maria Etezadi              1
Andrew Roberts             1
Grace Kelly                1
Bruce Money                1
Name: customer, Length: 777, dtype: int64

In [20]:
df_clean['order_date'].value_counts()

2010-12-12    11
2012-07-21    10
2010-09-17    10
2010-09-26    10
2011-09-15    10
              ..
2010-04-24     1
2011-09-18     1
2009-06-05     1
2010-03-06     1
2009-02-09     1
Name: order_date, Length: 1418, dtype: int64

In [21]:
df_clean['order_quantity'].value_counts()

4     136
31    133
46    130
23    128
39    127
43    126
3     125
6     125
24    123
20    122
32    121
50    121
7     118
1     117
29    116
8     114
42    113
41    112
16    112
36    112
44    111
30    111
12    111
34    109
37    109
26    108
47    108
25    107
27    107
33    106
10    106
5     106
40    105
35    105
48    105
14    104
15    104
21    104
17    104
38    101
13     98
28     97
9      97
18     96
45     96
19     95
2      92
11     91
22     91
49     84
Name: order_quantity, dtype: int64

In [22]:
df_clean['sales'].value_counts()

86580      3
449160     3
38720      3
253240     2
57640      2
          ..
260500     1
2924323    1
1222320    1
114060     1
4052020    1
Name: sales, Length: 5394, dtype: int64

In [23]:
df_clean['discount'].value_counts()

0.08    516
0.05    516
0.03    513
0       510
0.04    508
0.09    506
0.01    505
0.1     497
0.02    481
0.06    474
0.07    470
0.11      1
0.17      1
0.16      1
Name: discount, dtype: int64

In [24]:
df_clean['discount_value'].value_counts()

0         510
20066       3
3969        3
13475       3
1897        3
         ...
158608      1
9344        1
60599       1
43539       1
405202      1
Name: discount_value, Length: 4867, dtype: int64

In [25]:
df_clean['product_category'].value_counts()

Office Supplies    3066
Technology         1280
Furniture          1153
Name: product_category, dtype: int64

In [26]:
df_clean['product_sub_category'].value_counts()

Bindersand Binder Accessories    768
Paper                            736
Computer Peripherals             561
Office Furnishings               530
Telephonesand Communication      429
Appliances                       375
Pens&Art Supplies                359
Chairs&Chairmats                 301
Storage&Organization             276
Office Machines                  234
Labels                           206
Tables                           180
Envelopes                        174
Bookcases                        142
Rubber Bands                      97
Scissors,Rulersand Trimmers       75
Copiersand Fax                    56
Name: product_sub_category, dtype: int64

Changing the Data Type of Each Column

In [27]:
df_clean.dtypes

order_id                object
order_status            object
customer                object
order_date              object
order_quantity          object
sales                   object
discount                object
discount_value          object
product_category        object
product_sub_category    object
dtype: object

In [28]:
# Change data type object to datetime
df_clean['order_date'] = pd.to_datetime(df_clean['order_date'])

In [29]:
# Change data type object to float and int
df_clean['sales'] = df_clean['sales'].astype('int64')
df_clean['order_quantity'] = df_clean['order_quantity'].astype('int64')
df_clean['discount'] = df_clean['discount'].astype('float64')
df_clean['discount_value'] = df_clean['discount_value'].astype('int64')

In [30]:
df_clean.dtypes

order_id                        object
order_status                    object
customer                        object
order_date              datetime64[ns]
order_quantity                   int64
sales                            int64
discount                       float64
discount_value                   int64
product_category                object
product_sub_category            object
dtype: object

View the cleaned data's top 5 and bottom 5 data points.

In [31]:
df_clean.head()

,order_id,order_status,customer,order_date,order_quantity,sales,discount,discount_value,product_category,product_sub_category
0,3,Order Finished,Muhammed Mac Intyre,2010-10-13,6,523080,0.04,20923,Office Supplies,Storage&Organization
1,293,Order Finished,Barry French,2012-10-01,49,20246040,0.07,1417223,Office Supplies,Appliances
2,483,Order Finished,Clay Rozendal,2011-07-10,30,9931519,0.08,794522,Technology,Telephonesand Communication
3,515,Order Finished,Carlos Soltero,2010-08-28,19,788540,0.08,63083,Office Supplies,Appliances
4,613,Order Finished,Carl Jackson,2011-06-17,12,187080,0.03,5612,Office Supplies,Bindersand Binder Accessories

In [32]:
df_clean.tail()

,order_id,order_status,customer,order_date,order_quantity,sales,discount,discount_value,product_category,product_sub_category
5494,47360,Order Finished,Philip Brown,2010-10-08,25,4401280,0.05,220064,Furniture,Chairs&Chairmats
5495,52706,Order Finished,Paul Prost,2012-07-09,34,2083320,0.02,41666,Office Supplies,Bindersand Binder Accessories
5496,54279,Order Finished,Lisa De Cherney,2011-07-30,41,20142180,0.10,2014218,Technology,Office Machines
5497,55558,Order Finished,Philip Brown,2010-08-09,8,2588080,0.05,129404,Furniture,Bookcases
5498,56581,Order Finished,Lisa De Cherney,2009-02-08,20,4052020,0.10,405202,Furniture,Office Furnishings

Check outliers in the columns of order quantity, sales, discount, and discount values.

Check the size of the dataset after cleaning.

In [33]:
print('The amount of data after cleaning %d row and %d kolom ' % df_clean.shape)

The amount of data after cleaning 5499 row and 10 kolom

# 4. Analis

The next step is to do the analysis. In this analysis process, what will be analyzed is

a. sales revenue

b. net profit margins

c. Cost of Customer Acquisition (CAC)

In [34]:
# The first step is to add a new column, namely the years column, to the dataset.
df_clean['years'] = pd.DatetimeIndex(df_clean['order_date']).year
df_clean['years']

0       2010
1       2012
2       2011
3       2010
4       2011
        ...
5494    2010
5495    2012
5496    2011
5497    2010
5498    2009
Name: years, Length: 5499, dtype: int64

In [35]:
# Next is to filter using the order status "finished."
ovpby = df_clean.loc[df_clean['order_status'] == 'Order Finished']
print(ovpby.head())
ovpby['order_status'].shape

  order_id    order_status             customer order_date  order_quantity  \
0        3  Order Finished  Muhammed Mac Intyre 2010-10-13               6
1      293  Order Finished         Barry French 2012-10-01              49
2      483  Order Finished        Clay Rozendal 2011-07-10              30
3      515  Order Finished       Carlos Soltero 2010-08-28              19
4      613  Order Finished         Carl Jackson 2011-06-17              12

      sales  discount  discount_value product_category  \
0    523080      0.04           20923  Office Supplies
1  20246040      0.07         1417223  Office Supplies
2   9931519      0.08          794522       Technology
3    788540      0.08           63083  Office Supplies
4    187080      0.03            5612  Office Supplies

            product_sub_category  years
0           Storage&Organization   2010
1                     Appliances   2012
2    Telephonesand Communication   2011
3                     Appliances   2010
4  Bindersand Binder Accessories   2011

(4924,)

In [36]:
# Following that, use "Group by" to group data by year and aggregate data for sales and order id. 
ovpby = ovpby.groupby(['years']).agg({'sales':'sum','order_id':pd.Series.nunique}).sort_values('years',ascending=True)
ovpby = ovpby.rename(columns={'order_id':'number_of_orders'})

In [37]:
ovpby

            sales  number_of_orders
years
2009   4613872681              1244
2010   4059100607              1248
2011   4112036186              1178
2012   4482983158              1254

Rumus Formula yang akan digunakan

                        GrowthSales=(sales[y]/sales[y−1]−1)×100%
 
                        GrowthOrder=(order[y]/order[y−1]−1)×100%

In [38]:
# Formula Growth Sales

i = 0
growth_sales = []
while i <len(ovpby):
    if i == 0:
        growth_sales.append(0)
        i+=1

    growth_sales.append(round(((ovpby.iloc[i,0]/ovpby.iloc[i-1,0])-1),2))
    i+=1
growth_sales

[0, -0.12, 0.01, 0.09]

In [39]:
# Crate new coloumn growth sales
ovpby['growth_sales_%'] = growth_sales

In [40]:
# Create Formula Growth Order
i = 0
growth_order = []
while i <len(ovpby):
    if i == 0:
        growth_order.append(0)
        i+=1

    growth_order.append(round(((ovpby.iloc[i,1]/ovpby.iloc[i-1,1])-1),3))
    i+=1
growth_order

[0, 0.003, -0.056, 0.065]

In [41]:
# Create new coloumn growth order
ovpby['growth_order_%'] = growth_order

In [42]:
ovpby

            sales  number_of_orders  growth_sales_%  growth_order_%
years
2009   4613872681              1244            0.00           0.000
2010   4059100607              1248           -0.12           0.003
2011   4112036186              1178            0.01          -0.056
2012   4482983158              1254            0.09           0.065

It can be seen that there was a decrease in growth sales that occurred in 2010, and there was a decrease in growth orders in 2011.

Overall performance by product and subcategory

In [43]:
# Filtering the dataframe data by order_status and order_date
ovpbsc = df_clean.loc[(df_clean['order_status'] == 'Order Finished') & ((df_clean['years'] == 2011) | (df_clean['years'] == 2012))]
ovpbsc.head()

,order_id,order_status,customer,order_date,order_quantity,sales,discount,discount_value,product_category,product_sub_category,years
1,293,Order Finished,Barry French,2012-10-01,49,20246040,0.07,1417223,Office Supplies,Appliances,2012
2,483,Order Finished,Clay Rozendal,2011-07-10,30,9931519,0.08,794522,Technology,Telephonesand Communication,2011
4,613,Order Finished,Carl Jackson,2011-06-17,12,187080,0.03,5612,Office Supplies,Bindersand Binder Accessories,2011
5,643,Order Finished,Monica Federle,2011-03-24,21,5563640,0.07,389455,Office Supplies,Storage&Organization,2011
8,868,Order Finished,Carlos Daly,2012-06-08,32,1433680,0.00,0,Office Supplies,Appliances,2012

In [44]:
# Data should be grouped by year and column subcategory, then aggregated for the sales and order id columns. 
ovpbsc = ovpbsc.groupby(['years','product_sub_category']).agg({'sales':'sum','order_id':pd.Series.nunique})
ovpbsc = ovpbsc.sort_values(['years','sales'],ascending=[True,False])
ovpbsc = ovpbsc.rename(columns={'order_id':'number_of_orders'})

In [45]:
ovpbsc

                                         sales  number_of_orders
years product_sub_category
2011  Chairs&Chairmats               622962720                72
      Office Machines                545856280                43
      Tables                         505875008                41
      Copiersand Fax                 404074080                14
      Telephonesand Communication    392194658                92
      Bindersand Binder Accessories  298023200               178
      Storage&Organization           285991820                58
      Appliances                     272630020                81
      Computer Peripherals           232677960               106
      Bookcases                      169304620                26
      Office Furnishings             160471500               111
      Paper                          111080380               162
      Pens&Art Supplies               43093800                78
      Envelopes                       36463900                34
      Labels                          15607780                45
      Scissors,Rulersand Trimmers     12638340                19
      Rubber Bands                     3090120                18
2012  Office Machines                811427140                59
      Chairs&Chairmats               654168740                69
      Telephonesand Communication    422287514                99
      Tables                         388993784                40
      Bindersand Binder Accessories  363879200               176
      Storage&Organization           356714140                71
      Computer Peripherals           308014340               132
      Copiersand Fax                 292489800                12
      Appliances                     266131100                79
      Office Furnishings             178927480               108
      Bookcases                      159984680                28
      Paper                          126896160               167
      Envelopes                       58629280                42
      Pens&Art Supplies               43818480                81
      Scissors,Rulersand Trimmers     36776400                21
      Labels                          10007040                48
      Rubber Bands                     3837880                22

Analysis based on sales

using the burn rate method, which is to see the effectiveness of the campaign that has been made. for a formula like the following:

BurnRate = Total Discount / Total Sales × 100%

In [46]:
# filter dataframe on order status
Brby = df_clean.loc[df_clean['order_status'] == 'Order Finished']
Brby.head()

,order_id,order_status,customer,order_date,order_quantity,sales,discount,discount_value,product_category,product_sub_category,years
0,3,Order Finished,Muhammed Mac Intyre,2010-10-13,6,523080,0.04,20923,Office Supplies,Storage&Organization,2010
1,293,Order Finished,Barry French,2012-10-01,49,20246040,0.07,1417223,Office Supplies,Appliances,2012
2,483,Order Finished,Clay Rozendal,2011-07-10,30,9931519,0.08,794522,Technology,Telephonesand Communication,2011
3,515,Order Finished,Carlos Soltero,2010-08-28,19,788540,0.08,63083,Office Supplies,Appliances,2010
4,613,Order Finished,Carl Jackson,2011-06-17,12,187080,0.03,5612,Office Supplies,Bindersand Binder Accessories,2011

In [47]:
# Then use Groupby to group data by year and aggregate sales and discount values. 
Brby = Brby.groupby(['years']).agg({'sales':'sum', 'discount_value':'sum'})
Brby

            sales  discount_value
years
2009   4613872681       214330327
2010   4059100607       197506939
2011   4112036186       214611556
2012   4482983158       225867642

In [48]:
# Create a new column, namely "burn rate percentage."
Brby['burn_rate'] = ((Brby['discount_value'])/(Brby['sales'])).round(4)
Brby = Brby.rename(columns={'discount_value': 'promotion_value'})

In [49]:
Brby

            sales  promotion_value  burn_rate
years
2009   4613872681        214330327     0.0465
2010   4059100607        197506939     0.0487
2011   4112036186        214611556     0.0522
2012   4482983158        225867642     0.0504

Analyst based on Customer

In [50]:
# Customer Transaction per years
# Filter Dataframe dengan order status
CTY = df_clean.loc[df_clean['order_status'] == 'Order Finished']
CTY.head()

,order_id,order_status,customer,order_date,order_quantity,sales,discount,discount_value,product_category,product_sub_category,years
0,3,Order Finished,Muhammed Mac Intyre,2010-10-13,6,523080,0.04,20923,Office Supplies,Storage&Organization,2010
1,293,Order Finished,Barry French,2012-10-01,49,20246040,0.07,1417223,Office Supplies,Appliances,2012
2,483,Order Finished,Clay Rozendal,2011-07-10,30,9931519,0.08,794522,Technology,Telephonesand Communication,2011
3,515,Order Finished,Carlos Soltero,2010-08-28,19,788540,0.08,63083,Office Supplies,Appliances,2010
4,613,Order Finished,Carl Jackson,2011-06-17,12,187080,0.03,5612,Office Supplies,Bindersand Binder Accessories,2011

In [51]:
# grouping data by year, then aggregating data for the customer column
CTY = CTY.groupby(['years']).agg({'customer':pd.Series.nunique})
CTY = CTY.rename(columns={'customer':'number_of_Unique_customer'})

In [52]:
CTY

       number_of_Unique_customer
years
2009                         585
2010                         593
2011                         581
2012                         594

New Buyer Acquisition

In [53]:
# Filter Dataframe on order status
NBA = df_clean.loc[df_clean['order_status'] == 'Order Finished']
NBA.head()

,order_id,order_status,customer,order_date,order_quantity,sales,discount,discount_value,product_category,product_sub_category,years
0,3,Order Finished,Muhammed Mac Intyre,2010-10-13,6,523080,0.04,20923,Office Supplies,Storage&Organization,2010
1,293,Order Finished,Barry French,2012-10-01,49,20246040,0.07,1417223,Office Supplies,Appliances,2012
2,483,Order Finished,Clay Rozendal,2011-07-10,30,9931519,0.08,794522,Technology,Telephonesand Communication,2011
3,515,Order Finished,Carlos Soltero,2010-08-28,19,788540,0.08,63083,Office Supplies,Appliances,2010
4,613,Order Finished,Carl Jackson,2011-06-17,12,187080,0.03,5612,Office Supplies,Bindersand Binder Accessories,2011

In [54]:
NBA = NBA.sort_values('order_date', ascending=True)

In [55]:
# delete Duplicate
NBA['customer'] = NBA['customer'].drop_duplicates()
NBA

,order_id,order_status,customer,order_date,order_quantity,sales,discount,discount_value,product_category,product_sub_category,years
2897,28774,Order Finished,Jessica Myrick,2009-01-01,32,360720,0.10,36072,Office Supplies,Storage&Organization,2009
902,9285,Order Finished,David Philippe,2009-01-02,3,249620,0.06,14977,Office Supplies,Bindersand Binder Accessories,2009
4642,37537,Order Finished,Alan Schoenberger,2009-01-02,4,2478120,0.00,0,Furniture,Chairs&Chairmats,2009
4697,44069,Order Finished,Elizabeth Moffitt,2009-01-02,16,275260,0.09,24773,Office Supplies,Paper,2009
5143,7909,Order Finished,Alex Russell,2009-01-03,29,244460,0.03,7334,Office Supplies,Pens&Art Supplies,2009
...,...,...,...,...,...,...,...,...,...,...,...
613,13507,Order Finished,NaN,2012-12-29,27,352200,0.09,31698,Office Supplies,Paper,2012
3685,49344,Order Finished,NaN,2012-12-30,31,1345860,0.00,0,Technology,Computer Peripherals,2012
1468,25542,Order Finished,NaN,2012-12-30,37,514920,0.09,46343,Office Supplies,Paper,2012
4203,47815,Order Finished,NaN,2012-12-30,45,1161920,0.08,92954,Furniture,Office Furnishings,2012
4754,50950,Order Finished,NaN,2012-12-30,6,782240,0.06,46934,Furniture,Chairs&Chairmats,2012

In [56]:
# delete missing value
NBA.dropna(how='any', inplace=True)

In [57]:
# Group by year and aggregate data for the customer column
NBA = NBA.groupby(['years']).agg({'customer':pd.Series.nunique})
NBA = NBA.rename(columns={'customer':'number_of_new_customer'})
NBA

       number_of_new_customer
years
2009                      585
2010                      141
2011                       38
2012                       11

In [58]:
# Combine the NBA and CITY data frames by taking the years Total unique customer and total new customer columns
NTB = pd.merge(CTY, NBA, on='years')
NTB

       number_of_Unique_customer  number_of_new_customer
years
2009                         585                     585
2010                         593                     141
2011                         581                      38
2012                         594                      11

In [59]:
# Create a growth percentage from the number of new customers in the column.
i = 0
growth_new_customer = []
while i <len(NTB):
    if i == 0:
        growth_new_customer.append(0)
        i+=1

    growth_new_customer.append(round(((NTB.iloc[i,1]/NTB.iloc[i-1,1])-1),2))
    i+=1

In [60]:
# make a new column with the growth percentage 
NTB['growth_new_customer_%'] = growth_new_customer
NTB

,number_of_Unique_customer,number_of_new_customer,growth_new_customer_%
years,,,
2009,585,585,0.00
2010,593,141,-0.76
2011,581,38,-0.73
2012,594,11,-0.71

Suggest and advise:

1. In 2009-2011, there was no significant growth in sales and growth orders, but in 2012, there was a significant increase in growth sales and growth orders.
2. In 2011-2012, the scissors, ruler, and trimmer subcategories had a growth order increase of three points, but their growth sales increased by 191%. but there are also 5 subcategories that have negative sales growth.
3. There was no significant increase in sales growth from 2009-2012, which means that the promotion was less effective than the burn rate data; the increase was only around 5%.
4. For new customers, it has decreased every year; even the decline obtained through analysis has reached 70%.

advise:
Create a new marketing strategy or ads which can significantly bring in new unique customers.

Refrence:
1. Data Analyst Role: Apply Data Analysis Flowchart to measure Company Performance with SQL by Nelda Ampulembang Parenta: https://www.youtube.com/watch?v=J2BbebBcud4
2. Cohort Analysis & Customer Segmentation with RFM by Mahmoud El Fahl : https://www.kaggle.com/mahmoudelfahl/cohort-analysis-customer-segmentation-with-rfm#Let's-Make-Cohort-Analysis/
3. Customer Retention & Cohort Analysis | How VCs Calculate Customer Retention by Eric Andrews : https://www.youtube.com/watch?v=OwCATJh4lNg
4. Overall Analysis by DHAWY FARRAS PUTRA : https://www.kaggle.com/code/dhawyfarrasputra/overall-analysis-and-cohort-analysis